# Title : Pandas for Machine Learning 
### Author : Raj Shivprakash Poonam Jaiswal
### LinkedIn : https://www.linkedin.com/in/raj-jaiswal-481a33216/
### Twitter: https://twitter.com/home
### Github :https://github.com/Jaiswalraj2908

### ðŸ’»: Build Exercise Solutions
### ðŸŒˆ: Note 
### ðŸ“š: Resources 
### ðŸ“Œ: Session
### ðŸš€: Exercise

## Why Pandas ?

Pandas is mainly used for data analysis. Pandas allows importing data from various file formats such as comma-separated values (csv), JSON, SQL, Microsoft Excel. Pandas allows various data manipulation operations such as merging, reshaping, selecting, as well as data cleaning, and data wrangling features.

<img src= "pandas.png.crdownload"/>

### Import Pandas

In [1]:
import pandas as pd

## ðŸ“ŒSession 1 : Series ,DataFrame and CSV's

#### ðŸ“šResources : General FUnction :- https://pandas.pydata.org/pandas-docs/stable/reference/general_functions.html

### Create data using Pandas Series

In [2]:
cars_Brands_data = pd.Series(["Maruti" ,"BMW" ,"Audi" ,"Mercedes"])
print(cars_Brands_data)

0      Maruti
1         BMW
2        Audi
3    Mercedes
dtype: object

In [3]:
car_colors_data = pd.Series(["BLue" ,"Black" ,"Red","Silvermoon"])
print(car_colors_data)

0          BLue
1         Black
2           Red
3    Silvermoon
dtype: object

### It seems like we can only insert one column , Right? Well i dont know.. if in Doubts lets try and code..

In [4]:
multiple_series_data = pd.Series(["Pandas","Matplotlib" ,"Numpy"] ,["MacOs" ,"windows" ,"Linux"] )
print(multiple_series_data)

MacOs          Pandas
windows    Matplotlib
Linux           Numpy
dtype: object

### It seems working but it ( dataframe ) doesnot make any sense...Ahh lets try more columns

In [5]:
multiple_series_data_2 = pd.Series(["Pandas","Matplotlib" ,"Numpy"] ,["MacOs" ,"windows" ,"Linux"] ,["Python" ,"R","Julia"] )
print(multiple_series_data_2)

TypeError: Field elements must be 2- or 3-tuples, got ''Python''

## Conclusion on Pandas Series:

### Pandas Series

Pandas Series is a **one-dimensional labeled array** capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index. Pandas Series is nothing but a column in an excel sheet

### Create data using Pandas DataFrame

#### ðŸ“šResources : DataFrames :- https://www.geeksforgeeks.org/different-ways-to-create-pandas-dataframe/

In [6]:
car_details = {"Brand" : ["Maruti" ,"BMW" ,"Audi" ,"Mercedes"] ,"Colors" : ["Blue" ,"Black" ,"Red","Silvermoon"] ,
              "Price ($) ": [2000,70000,50000,55000]}

In [7]:
car_dataframe = pd.DataFrame(data=car_details)
print(car_dataframe)

      Brand      Colors  Price ($)
0    Maruti        Blue        2000
1       BMW       Black       70000
2      Audi         Red       50000
3  Mercedes  Silvermoon       55000

## ðŸ¤©Woooahhh!!!!! This was hella easy...

In [8]:
# Alternative method using series data and pass as a value to the keys ( optional)

car_df = pd.DataFrame({"Brand" :cars_Brands_data ,"colors" : car_colors_data })
print(car_df)

      Brand      colors
0    Maruti        BLue
1       BMW       Black
2      Audi         Red
3  Mercedes  Silvermoon

## What is difference between pandas series and pandas DataFrame?


**Series** can only contain **single list with index**, whereas **dataframe** can be made of **more than one series** or we can say that a **dataframe is a collection of series** that can be used to analyse the data.

### ðŸš€ Exercise :   Create  DataFrame of School Marksheet with Columns of Subjects , Name ,Total and Result .

#### To be honest ..This was very tedious work to make a DataFrame by own..and i dont suggest to make our own dataset like this to work on ( practice ) ...so lets import the csv files ( ready made dataset ) using Pandas .

## Import dataset using pandas

In [171]:
dataset_car_sales = pd.read_csv("car-sales.csv")

In [123]:
print(dataset_car_sales)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

<img src = "pandas-anatomy-of-a-dataframe.png"/>

## Export data using pandas to csv file

In [11]:
dataset_car_sales.to_csv("exported_car_sales_data.csv" ,index =False) # check the location where you have saved pandas jupyter notebook

In [12]:
exported_dataset = pd.read_csv("exported_car_sales_data.csv")
print(exported_dataset)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## ðŸ“ŒSession 2 : Describe data with pandas

## Before Heading ... Read this 

Attribures aand functions both are different although they both initiate with .(dot) but attribute has no parenthesis while functions have. So keep in mind attributes just gives insights of data on the other hand functions perform task on data.

### ðŸ˜ŽPro Tip : Press tab after .(dot) or in parenthesis to know more and to complete code

## Attributes

In [13]:
dataset_car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [14]:
dataset_car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [15]:
dataset_car_sales.index

RangeIndex(start=0, stop=10, step=1)

### ðŸš€Exercise : Give yourself a try to explore more attributes

## Functions

In [20]:
dataset_car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [24]:
print("Counts of duplicated rows :")
dataset_car_sales.duplicated().sum()

Counts of duplicated rows :

0

In [23]:
print("Null values in any columns")
dataset_car_sales.isnull().sum()

Null values in any columns

Make             0
Colour           0
Odometer (KM)    0
Doors            0
Price            0
dtype: int64

In [16]:
dataset_car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

Provide **descriptive statistical** information about **int/float form datatype**

### ðŸ˜¨Heyy!!!! But where is Price column? Price is an also a number... You are right..Lets find it out togeather

In [17]:
dataset_car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

**Here is the problem in the datatypes . we know the numerical contained columns are eligible for describe function but if we closely observed
the odometer and doors have int64 while price has object dataype.**

***so we need to change the:***


***1. Remove "$" , "," and ".00"***

***2. Price datatype "object" to "int"***

#### ðŸ“šResources : Price Columns : https://stackoverflow.com/questions/44469313/price-column-object-to-int-in-pandas |

#### Remove Decimals : https://stackoverflow.com/questions/37084812/how-to-remove-decimal-points-in-pandas

In [153]:
dataset_car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  toyota  White         150043      4   400000
1   honda    Red          87899      4   500000
2  toyota   Blue          32549      3   700000
3     bmw  Black          11179      5  2200000
4  nissan  White         213095      4   350000
5  toyota  Green          99213      4   450000
6   honda   Blue          45698      4   750000
7   honda   Blue          54738      4   700000
8  toyota  White          60000      4   625000
9  nissan  White          31600      4   970000

In [168]:
dataset_car_sales["Price"]

0     $4,000.00
1     $5,000.00
2     $7,000.00
3    $22,000.00
4     $3,500.00
5     $4,500.00
6     $7,500.00
7     $7,000.00
8     $6,250.00
9     $9,700.00
Name: Price, dtype: object

In [172]:
dataset_car_sales['Price'] = dataset_car_sales['Price'].replace('[\$\,]', '', regex=True).apply(lambda x: x.replace('.00','')) # Read Regex from my Python Notebook

In [173]:
dataset_car_sales["Price"] # Remove the $ sign and Decimals

0     4000
1     5000
2     7000
3    22000
4     3500
5     4500
6     7500
7     7000
8     6250
9     9700
Name: Price, dtype: object

In [148]:
dataset_car_sales["Price"] = dataset_car_sales['Price'].astype(int) # change the dtype of Price from object to int

In [149]:
dataset_car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price             int32
dtype: object

In [150]:
dataset_car_sales.describe()  # Sucessfully now Price is shown in Descriptive Statistics

       Odometer (KM)      Doors         Price
count      10.000000  10.000000  1.000000e+01
mean    78601.400000   4.000000  7.645000e+05
std     61983.471735   0.471405  5.379408e+05
min     11179.000000   3.000000  3.500000e+05
25%     35836.250000   4.000000  4.625000e+05
50%     57369.000000   4.000000  6.625000e+05
75%     96384.500000   4.000000  7.375000e+05
max    213095.000000   5.000000  2.200000e+06

In [151]:
dataset_car_sales.mean()

Odometer (KM)     78601.4
Doors                 4.0
Price            764500.0
dtype: float64

In [27]:
print("Total Numbers of Doors in Dataset")
dataset_car_sales["Doors"].sum()

Total Numbers of Doors in Dataset

40

In [35]:
len(dataset_car_sales)

10

## ðŸ“ŒSession 3 : Viewing and Selecting Data

In [36]:
dataset_car_sales.head()   # Top 5 Rows of the table

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   400000
1   Honda    Red          87899      4   500000
2  Toyota   Blue          32549      3   700000
3     BMW  Black          11179      5  2200000
4  Nissan  White         213095      4   350000

In [38]:
dataset_car_sales.sample(5)    # Random 5 rows of the table

     Make Colour  Odometer (KM)  Doors    Price
5  Toyota  Green          99213      4   450000
3     BMW  Black          11179      5  2200000
0  Toyota  White         150043      4   400000
6   Honda   Blue          45698      4   750000
7   Honda   Blue          54738      4   700000

In [39]:
dataset_car_sales.tail()   # Bottom 5 Rows of the Table

     Make Colour  Odometer (KM)  Doors   Price
5  Toyota  Green          99213      4  450000
6   Honda   Blue          45698      4  750000
7   Honda   Blue          54738      4  700000
8  Toyota  White          60000      4  625000
9  Nissan  White          31600      4  970000

In [80]:
laptop_dataset = {"Brand" :["Apple" ,"Lenovo", "Asus","Windows","HP","Dell","MSI" ,"Avita" ,"Google Chromebook"],
                 "Price ($)" : [1000,700,800,990,750,820,990,560,320] ,"Ranking in 2020 " : [ 1,5,3,8,4,6,2,7,9]}

In [81]:
laptop_dataset_df = pd.DataFrame(data=laptop_dataset)

In [82]:
laptop_dataset_df

               Brand  Price ($)  Ranking in 2020
0              Apple       1000                 1
1             Lenovo        700                 5
2               Asus        800                 3
3            Windows        990                 8
4                 HP        750                 4
5               Dell        820                 6
6                MSI        990                 2
7              Avita        560                 7
8  Google Chromebook        320                 9

In [58]:
laptop_dataset_df["Brand"]

0                Apple
1               Lenovo
2                 Asus
3              Windows
4                   HP
5                 Dell
6                  MSI
7                Avita
8    Google Chromebook
Name: Brand, dtype: object

In [59]:
laptop_dataset_df["Brand"].value_counts()

Apple                1
Lenovo               1
HP                   1
Asus                 1
MSI                  1
Dell                 1
Windows              1
Avita                1
Google Chromebook    1
Name: Brand, dtype: int64

In [62]:
laptop_dataset_df["Price ($)"].value_counts()

990     2
800     1
820     1
1000    1
560     1
700     1
320     1
750     1
Name: Price ($), dtype: int64

In [75]:
laptop_dataset_df

               Brand  Price ($)  Ranking in 2020
0              Apple       1000                 1
1             Lenovo        700                 5
2               Asus        800                 3
3            Windows        990                 8
4                 HP        750                 4
5               Dell        820                 6
6                MSI        990                 2
7              Avita        560                 7
8  Google Chromebook        320                 9

In [78]:
laptop_dataset_df["Brand"] = "Asus Chromebook" # want to replace Google Chromebook by Asus Chromebook BUT we got something else (below image)

<img src  = "save@.PNG"/>

 ### ðŸ“šResources :  replace values :-https://datatofish.com/replace-values-pandas-dataframe/

In [76]:
laptop_dataset_df['Brand'] = laptop_dataset_df['Brand'].replace(['Google Chromebook'],'Asus Chromebook')

In [77]:
laptop_dataset_df["Brand"]

0              Apple
1             Lenovo
2               Asus
3            Windows
4                 HP
5               Dell
6                MSI
7              Avita
8    Asus Chromebook
Name: Brand, dtype: object

In [83]:
laptop_dataset_df[laptop_dataset_df["Brand"] == "Apple"]

   Brand  Price ($)  Ranking in 2020
0  Apple       1000                 1

In [86]:
laptop_dataset_df[laptop_dataset_df["Price ($)"] >= 820]

     Brand  Price ($)  Ranking in 2020
0    Apple       1000                 1
3  Windows        990                 8
5     Dell        820                 6
6      MSI        990                 2

### ðŸ“šResources : iloc vs loc : https://www.analyticsvidhya.com/blog/2020/02/loc-iloc-pandas/

In [50]:
laptop_dataset_df.loc[3]

Brand               Windows
Price ($)               990
Ranking in 2020           8
Name: 3, dtype: object

In [52]:
laptop_dataset_df.iloc[3]

Brand               Windows
Price ($)               990
Ranking in 2020           8
Name: 3, dtype: object

In [53]:
animals = pd.Series(["Lion" ,"tiger" ,"Rhino" ,"panda","fox"] ,index=[0,3,3,4,8])

In [54]:
print(animals)

0     Lion
3    tiger
3    Rhino
4    panda
8      fox
dtype: object

In [55]:
animals.loc[3]

3    tiger
3    Rhino
dtype: object

In [57]:
animals.iloc[3]

'panda'

In [89]:
dataset_car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   400000
1   Honda    Red          87899      4   500000
2  Toyota   Blue          32549      3   700000
3     BMW  Black          11179      5  2200000
4  Nissan  White         213095      4   350000
5  Toyota  Green          99213      4   450000
6   Honda   Blue          45698      4   750000
7   Honda   Blue          54738      4   700000
8  Toyota  White          60000      4   625000
9  Nissan  White          31600      4   970000

In [90]:
pd.crosstab(dataset_car_sales["Make"] ,dataset_car_sales["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [93]:
dataset_car_sales["Make"].unique()

array(['Toyota', 'Honda', 'BMW', 'Nissan'], dtype=object)

In [94]:
dataset_car_sales["Doors"].unique()

array([4, 3, 5], dtype=int64)

In [98]:
dataset_car_sales.groupby(["Make"]).mean()

        Odometer (KM)  Doors    Price
Make
BMW      11179.000000   5.00  2200000
Honda    62778.333333   4.00   650000
Nissan  122347.500000   4.00   660000
Toyota   85451.250000   3.75   543750

## ðŸ“ŒSession 4 : Manipulating Data

In [117]:
dataset_car_sales["Make"].str.lower()

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

In [124]:
dataset_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [127]:
dataset_car_sales["Make"] = dataset_car_sales["Make"].str.lower()

In [128]:
dataset_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  toyota  White         150043      4   $4,000.00
1   honda    Red          87899      4   $5,000.00
2  toyota   Blue          32549      3   $7,000.00
3     bmw  Black          11179      5  $22,000.00
4  nissan  White         213095      4   $3,500.00
5  toyota  Green          99213      4   $4,500.00
6   honda   Blue          45698      4   $7,500.00
7   honda   Blue          54738      4   $7,000.00
8  toyota  White          60000      4   $6,250.00
9  nissan  White          31600      4   $9,700.00

In [136]:
missing_car_csv = pd.read_csv("car-sales-missing-data.csv")

In [137]:
print(missing_car_csv)

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [139]:
print(missing_car_csv["Odometer"].isnull().sum())  # Total NUll values in a Odometer Colm.

4

In [140]:
missing_car_csv["Odometer"].fillna(missing_car_csv["Odometer"].mean() ,inplace =True)  # Fill NULL values by mean values of that colm

In [141]:
missing_car_csv  # observe Odomoeter row 2,5,6,7, filled with mean value of Odometer colm

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [142]:
missing_car_csv["Odometer"].isnull().sum() # No NULL values in Odometer colm

0

## ðŸš€Exercise : Try yourself ( follow the statement below )

In [ ]:
# try yourself for price to fill NaN ( Not a Number )

In [ ]:
len(dataset_car_sales) # before drop

In [ ]:
# dataset_car_sales.dropna(inplace=True)

In [ ]:
len(dataset_car_sales) # after drop

In [ ]:
dataset_car_sales

In [ ]:
#  add colms 1. seats(using series ) 2. fuel per 100kms (python lists ) 3.total fuel  = (odometer/100) * fuel pper 100kms 4.paaed eoad safety (boolean)

In [ ]:
# drop cols total fuel  . create two dupl cols with and without litres

### Congratulations ... ðŸ”¥You have Practice this library with dedication and i appreciate your efforts